{
  "backend/main.mo": "Defines casino backend types and storage maps for profiles, settings, assets, symbols, and config, with authorization and storage mixins and symbol-set read/update APIs.",
  "feature_evidence.json": "Feature evidence report linking two frontend files to requirements about generating and serving a static fallback logo asset.",
  "frontend-file-summaries.txt": "Prewritten summaries describing behavior and responsibilities of all frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind-based style definitions configuring OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication, loading state with cache‑busted logo, theme application, and rendering header, lobby, footer, banners, and profile setup.",
  "frontend/src/components/admin/AdminUnlockDialog.tsx": "Dialog for entering a session password to unlock admin settings with validation and error messaging. Requires both admin permission and correct password.",
  "frontend/src/components/admin/AppAssetsEditor.tsx": "Admin tool to upload or import images for app assets, track progress, and update stored asset metadata. Supports overwrite or create behavior based on existing assets.",
  "frontend/src/components/admin/BottomBannerEditor.tsx": "Admin editor for configuring a bottom banner, including enabling, image upload/import, preview, and destination URL. Saves updated banner config via backend mutation.",
  "frontend/src/components/admin/GameCatalogEditor.tsx": "Provides an editor UI to manage default and persisted game catalog entries, supporting image upload, URL import, and form updates.",
  "frontend/src/components/admin/GradientEditorField.tsx": "Offers a visual and raw CSS gradient editor that parses, edits, and serializes gradient values with direction and color-stop controls.",
  "frontend/src/components/admin/SymbolSetEditor.tsx": "Enables editing of symbol sets per game, including adding, removing, reordering, renaming, and uploading images with previews.",
  "frontend/src/components/admin/ThemeEditor.tsx": "Allows viewing and modifying global theme config including colors and gradients, with preset selection and server-side persistence.",
  "frontend/src/components/AdminSettingsModal.tsx": "Admin modal providing tabbed UI to edit casino settings, branding, theme, banners, symbols, catalog, and images.",
  "frontend/src/components/BottomBanner.tsx": "Renders a clickable bottom banner using admin‑configured settings and cache‑busted external image blobs.",
  "frontend/src/components/Footer.tsx": "Simple footer showing static DexFans 2026 text.",
  "frontend/src/components/GameWrapper.tsx": "Layout wrapper for game screens showing back navigation and diamond balance, plus a hook for recording game outcomes. Provides balance and async recording state.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling login/logout, admin unlock flow, and dynamic asset-based branding. Displays user balance, wallet modal, and admin settings access.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to set a username and submit profile creation. Handles simple form validation and loading state.",
  "frontend/src/components/ThemeApplier.tsx": "Fetches theme config and applies it to the document root on load. Contains no UI and runs once at app root.",
  "frontend/src/components/WalletModal.tsx": "Wallet modal showing balances, wagering stats, and transaction history with deposit/withdrawal actions. Supports filtering transactions and validating min amounts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useAdminUnlock.ts": "Provides simple session-based admin unlocking with a fixed password and lock/unlock state tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, storing identities, handling login flows, and exposing identity state via context.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profile, balance, transactions, game history, and mutations like register, deposit, withdraw, and record game outcomes using an actor API.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes and applies global background and text styles.",
  "frontend/src/lib/animations.ts": "Implements a canvas-based particle system with explosion, confetti, and sparkle effects plus a React hook to manage it.",
  "frontend/src/lib/appAssets.ts": "Defines canonical app asset metadata, fallback paths, and helpers for retrieving asset data and versioned URLs.",
  "frontend/src/lib/gradientUtils.ts": "Utility functions for parsing, serializing, extracting colors from, and generating simple CSS gradients.",
  "frontend/src/lib/theme.ts": "Applies theme configuration to CSS variables and returns the effective theme, currently global-only.",
  "frontend/src/lib/themePresets.ts": "Provides predefined theme presets with color and gradient configs plus a lookup helper.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers and loads global styles.",
  "frontend/src/pages/GameLobby.tsx": "Renders the main game lobby, loading user data and catalog assets to display available games and launching selected game components.",
  "frontend/src/pages/games/BlackjackGame.tsx": "Implements a playable blackjack game with betting, card drawing, scoring logic, animations, and outcome recording.",
  "frontend/src/pages/games/CardDrawGame.tsx": "Empty placeholder file.",
  "frontend/src/pages/games/CoinFlipGame.tsx": "Empty placeholder file.",
  "frontend/src/pages/games/DiceRollGame.tsx": "Provides a dice-rolling betting game with animated dice, over/under prediction logic, and outcome recording.",
  "frontend/src/pages/games/JackpotGame.tsx": "Runs a 5‑reel jackpot slot game with symbol matching, animations, winnings calculation, and outcome logging.",
  "frontend/src/pages/games/MinesGame.tsx": "Empty placeholder file.",
  "frontend/src/pages/games/NumberGuessGame.tsx": "Empty placeholder file.",
  "frontend/src/pages/games/RouletteGame.tsx": "Empty placeholder file.",
  "frontend/src/pages/games/SlotsGame.tsx": "Implements a 3‑reel slots game with animated spins, symbol matching, payout logic, and recorded results.",
  "frontend/src/pages/games/WheelSpinGame.tsx": "React component implementing a wheel‑spin betting game with canvas rendering, spin animation, particle effects, and backend outcome recording.",
  "frontend/src/utils/cacheBusting.ts": "Provides helpers to append version tokens to URLs for cache‑busting, including utilities for ExternalBlob URLs.",
  "frontend/src/utils/imageUrlImport.ts": "Validates and fetches an image from a URL, enforces size/type limits, and converts it into an ExternalBlob.",
  "frontend/src/utils/sanitizeSvg.ts": "Sanitizes SVG strings by rejecting unsafe tags/attributes and returning safe or fallback SVG output.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters, supporting both query and hash routing with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and plugins for the frontend UI.",
  "project_state.json": "Describes the project's state, features, and architecture for the casino dApp backend and frontend."
}