{
  "backend/main.mo": "Main Motoko canister implementing the casino backend: user profiles, transactions, game outcomes, symbol sets, and an admin-managed game catalog with access control, storage, Stripe integration, and settings management.",
  "backend/migration.mo": "Stub migration module that currently performs a no-op state migration, returning the old actor unchanged.",
  "feature_evidence.json": "Feature evidence report documenting implemented backend and frontend features (game catalog, admin UI extensions, symbol-based rendering) with affected files, dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summary map describing the purpose of major frontend files, components, hooks, pages, and styling used across the application.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, and base styles for the entire frontend.",
  "frontend/index.html": "HTML entry point that defines the root container and loads the React application bundle.",
  "frontend/src/App.tsx": "Root React component handling Internet Identity authentication, profile setup flow, theme provider, and rendering the header, game lobby, and footer.",
  "frontend/src/components/admin/GameCatalogEditor.tsx": "Admin editor for managing the game catalog, allowing creation and updating of game metadata and images with upload progress and default game presets.",
  "frontend/src/components/admin/SymbolSetEditor.tsx": "Admin tool for editing per-game symbol sets, supporting adding, removing, reordering symbols and uploading symbol images with validation.",
  "frontend/src/components/AdminSettingsModal.tsx": "Admin-only modal with tabbed UI for editing casino settings, symbol sets, and the backend-persisted game catalog.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying branding text with a styled background.",
  "frontend/src/components/GameWrapper.tsx": "Shared layout and helper hook for game pages, providing back navigation, balance display, and standardized game outcome recording logic.",
  "frontend/src/components/Header.tsx": "Top navigation header that handles Internet Identity authentication, shows user balance and profile menu, and opens wallet or admin settings modals based on auth and admin status.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog prompting new users to choose a username, handling submission and loading state before starting gameplay.",
  "frontend/src/components/WalletModal.tsx": "Comprehensive wallet modal showing balances, wagering stats, transaction history, and tabs for depositing and withdrawing diamonds with eligibility and minimum checks.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on the current Internet Identity, initializing access control and invalidating dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider wrapping Dfinity Internet Identity, exposing login/logout functions, identity state, and detailed login status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating casino backend data such as user profiles, balances, histories, leaderboards, game catalogs, and recording game outcomes, with toast notifications and cache invalidation.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines global design tokens (colors, radius, charts) for light/dark themes, plus base styling for borders and body background/text.",
  "frontend/src/lib/animations.ts": "Implements a canvas-based particle animation system (explosions, confetti, sparkles) and a React hook to manage its lifecycle for casino game visual effects.",
  "frontend/src/main.tsx": "Bootstraps the React app by rendering App inside React Query and Internet Identity providers and importing global styles.",
  "frontend/src/pages/GameLobby.tsx": "Renders the main game lobby UI, fetching user profile, leaderboards, and game catalog data, and allows selecting and launching individual casino games.",
  "frontend/src/pages/games/BlackjackGame.tsx": "Implements a playable Blackjack game with betting, card logic, animations, symbol assets, particle effects, and recording results to the backend.",
  "frontend/src/pages/games/CardDrawGame.tsx": "Empty placeholder file for a future Card Draw game implementation.",
  "frontend/src/pages/games/CoinFlipGame.tsx": "Empty placeholder file for a future Coin Flip game implementation.",
  "frontend/src/pages/games/DiceRollGame.tsx": "Implements a dice roll betting game with over/under predictions, animated dice, particle effects on wins, balance checks, and backend outcome recording.",
  "frontend/src/pages/games/JackpotGame.tsx": "Implements a five-reel jackpot slot game with betting, animated spinning reels, win multipliers based on symbol matches, particle effects for wins, and recording outcomes via backend hooks.",
  "frontend/src/pages/games/MinesGame.tsx": "File is present but contains no code or content in the provided snippet.",
  "frontend/src/pages/games/NumberGuessGame.tsx": "File is present but contains no code or content in the provided snippet.",
  "frontend/src/pages/games/RouletteGame.tsx": "File is present but contains no code or content in the provided snippet.",
  "frontend/src/pages/games/SlotsGame.tsx": "Implements a three-reel slots game with betting validation, animated reel spins, emoji or custom symbols, win multipliers, particle effects, and backend outcome recording.",
  "frontend/src/pages/games/WheelSpinGame.tsx": "Implements a wheel spin betting game that renders a segmented wheel on canvas, animates rotation with easing, calculates multipliers, triggers particle effects on wins, and records outcomes.",
  "frontend/src/utils/sanitizeSvg.ts": "Provides basic SVG sanitization and validation by rejecting unsafe tags/attributes, enforcing size limits, and offering helpers to validate or render a safe fallback SVG.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from query or hash, persisting them in sessionStorage, and safely clearing or retrieving stored parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, dark mode, extended theme tokens (colors, radius, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing Diamond Casino, a full-stack Internet Computer casino app with a Motoko backend and React frontend, including auth, roles, balances, games, Stripe integration, and admin tooling. It enumerates existing features, versions, and recent scope requests for UI customization, asset management, and game changes."
}