{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Default site logo fallback from uploaded image (static asset)",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Add a generated 256×256 transparent-capable fallback logo asset and use it when no backend site-logo asset is available and when the header logo fails to load.",
      "acceptanceCriteria": [
        "`frontend/public/assets/generated/site-logo-fallback.dim_256x256.png` exists and is 256×256.",
        "When no custom `site-logo` asset is stored in the backend, the header logo renders using the new fallback image.",
        "If the header logo image fails to load, the UI still falls back to `/assets/generated/site-logo-fallback.dim_256x256.png` without breaking layout."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/site-logo-fallback.dim_256x256.png",
          "operation": "create",
          "description": "Create the default site logo fallback image from the user-provided upload, formatted to a 256×256 square, preserving transparency if present. Save it exactly at this path and filename."
        },
        {
          "path": "frontend/src/lib/appAssets.ts",
          "operation": "modify",
          "description": "Ensure the `site-logo` asset definition uses the fallback path `/assets/generated/site-logo-fallback.dim_256x256.png`, and (to avoid future drift) export a shared constant for the site logo fallback path used across the app."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Wire the header logo rendering to consistently fall back to the generated static asset when (a) no backend `site-logo` is present (via appAssets fallback) and (b) when the logo `<img>` fails to load (onError), using the shared fallback constant to keep the layout stable."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Serve the fallback logo directly as a frontend static asset (never through backend blob/storage) and ensure the UI requests it by the static path.",
      "acceptanceCriteria": [
        "The app requests the logo fallback via the path `/assets/generated/site-logo-fallback.dim_256x256.png`.",
        "No backend endpoints or blob storage are required for the fallback logo to display."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/appAssets.ts",
          "operation": "modify",
          "description": "Centralize and enforce the static fallback path for `site-logo` so that the initial render (when backend replacement is missing) uses `/assets/generated/site-logo-fallback.dim_256x256.png` directly from frontend public assets."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Ensure the header logo failure-handling always swaps to `/assets/generated/site-logo-fallback.dim_256x256.png` (static asset) rather than retrying any backend-derived URL, preventing broken layout and avoiding backend routing for the fallback."
        }
      ]
    }
  ]
}