{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Diamond Casino is a full-stack Internet Computer (ICP) casino dApp. A Motoko backend canister provides role-based access control (admin/user/guest), user registration with a diamond signup bonus, a diamond balance ledger (deposits/withdrawals + game win/loss transactions), wagering-based withdrawal eligibility, persistent casino settings, per-game symbol set configuration (image blobs with updatedAt timestamps), a customizable game catalog (titles/descriptions/cover images), a unified app-asset store for replaceable UI images (logos/icons/game covers), site branding (display name), global theme configuration (colors + gradients), and a configurable bottom promotional banner. The React + Tailwind/shadcn/ui frontend authenticates users via Internet Identity, centralizes canister calls via TanStack React Query hooks, renders a game lobby with leaderboards, wallet UI, and admin settings, and includes several playable betting mini-games (Slots, Blackjack, Dice Roll, Wheel Spin, Jackpot) that record outcomes to the backend. The system also includes Stripe integration via IC HTTP outcalls (checkout sessions/status) and blob-storage maintenance/cycles refill endpoints.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "Internet Identity",
        "AuthClient",
        "InternetIdentityProvider"
      ],
      "description": "Provides a React context wrapping `@dfinity/auth-client` to initialize the client, restore stored delegations on load, perform login/logout, and expose detailed status flags and errors to the UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Identity-bound backend actor creation and query cache reset",
      "synonyms": [
        "useActor",
        "createActorWithConfig",
        "actor recreation"
      ],
      "description": "Creates an anonymous actor when unauthenticated and an identity-bound actor when authenticated. When the actor instance changes (e.g., identity change), all non-actor React Query caches are invalidated/refetched to keep data consistent.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Role-based access control with admin bootstrap secret token",
      "synonyms": [
        "AccessControl",
        "MixinAuthorization",
        "CAFFEINE_ADMIN_TOKEN"
      ],
      "description": "Implements per-principal roles (#admin/#user/#guest). The first principal to initialize with the correct secret token becomes admin; others become users. Provides role lookup, admin checks, and admin role assignment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Secure extraction and session persistence of secret URL hash parameters",
      "synonyms": [
        "getSecretParameter",
        "getSecretFromHash",
        "urlParams"
      ],
      "description": "Reads sensitive parameters from the URL hash fragment, persists them to `sessionStorage`, and clears them from the URL to reduce history/referrer leakage (used for admin bootstrap token).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "User registration and profile persistence with signup bonus",
      "synonyms": [
        "registerUser",
        "UserProfile",
        "signup_bonus"
      ],
      "description": "Allows authenticated users to register a username. Creates a stored user profile with an initial 1000-diamond balance and writes a corresponding `signup_bonus` ledger transaction.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Diamond wallet ledger (balance, deposits, withdrawals, transaction history UI)",
      "synonyms": [
        "deposit",
        "withdraw",
        "getBalance",
        "getTransactionHistory",
        "WalletModal"
      ],
      "description": "Maintains per-user balances and an append-only transaction history. UI provides a wallet modal with balance and stats, deposit/withdraw actions (min constraints from casino settings), and a filterable transaction history feed.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Wagering requirement tracking and withdrawal eligibility gating",
      "synonyms": [
        "diamondsWagered",
        "hasCompletedWageringRequirement",
        "isUserEligibleForWithdrawal"
      ],
      "description": "Tracks diamonds wagered and blocks withdrawals until the wagering threshold is met; frontend visualizes progress and disables withdrawal UI when ineligible.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Game outcome recording with per-user stats and game history",
      "synonyms": [
        "recordGameOutcome",
        "getGameHistory",
        "game_win",
        "game_loss"
      ],
      "description": "Records game outcomes, updates user aggregates (games played, wager totals, wins/losses, streaks), updates balance, and writes win/loss transactions; users can query their historical outcomes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Leaderboards (top players by balance, wins, and streak)",
      "synonyms": [
        "getTopPlayers",
        "getTopPlayersByWins",
        "getTopPlayersByStreak"
      ],
      "description": "Computes and exposes top-N leaderboards based on diamond balance, total wins, and max streak; the lobby renders them in a tabbed panel.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Admin-configurable casino settings",
      "synonyms": [
        "CasinoSettings",
        "getCasinoSettings",
        "updateCasinoSettings"
      ],
      "description": "Admins can update configurable casino parameters (min deposit/withdrawal, house edge percentage, dealer username, currency name). All clients can read current settings for UI validation and display.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Site branding (display name) with runtime title updates",
      "synonyms": [
        "SiteBranding",
        "getBranding",
        "updateBranding",
        "document.title"
      ],
      "description": "Stores a site display name in the backend with admin-only updates and public read access. Frontend shows it in the header and updates the browser tab title accordingly.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Global theme configuration applied via CSS variables",
      "synonyms": [
        "ThemeConfig",
        "ThemeApplier",
        "applyTheme",
        "getThemeConfig",
        "setThemeConfig"
      ],
      "description": "Persists a global theme (colors and gradients) in the backend; the frontend fetches and applies it by writing CSS custom properties to the document root, enabling theme-driven styling across the app.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Theme editor with presets and gradient visual/raw editor",
      "synonyms": [
        "ThemeEditor",
        "themePresets",
        "GradientEditorField",
        "gradientUtils"
      ],
      "description": "Admin UI to edit theme colors and gradients with one-click presets. Includes a best-effort visual gradient editor (direction + stops) with a raw CSS fallback and live preview.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Bottom banner configuration and rendering",
      "synonyms": [
        "BannerConfig",
        "BottomBannerEditor",
        "BottomBanner",
        "objectFit"
      ],
      "description": "Admins can configure a site-wide clickable bottom banner (enable/disable, image, destination URL, height/padding/background color, and object-fit mode). Frontend renders it fixed at the bottom of the page and opens the configured URL on click.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Unified app asset storage (logos, icons, game covers) with admin editor",
      "synonyms": [
        "AppAsset",
        "AppAssetsEditor",
        "getAllAssets",
        "storeAsset",
        "updateAsset"
      ],
      "description": "Backend stores replaceable app assets keyed by `assetId` (e.g., site logo, loading logo, diamond icon, game cover images). Admin UI supports upload/replace, progress feedback, and immediate preview with fallbacks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Game catalog management with custom titles/descriptions/cover images",
      "synonyms": [
        "GameCatalogEntry",
        "GameCatalogEditor",
        "getAllGameCatalogEntries",
        "addGameCatalogEntry",
        "updateGameCatalogEntry"
      ],
      "description": "Admins can create/update persisted game catalog entries (gameId/title/description/icon). The lobby overlays catalog data on a fixed list of supported games.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Per-game symbol set management with image upload, ordering, and timestamps",
      "synonyms": [
        "GameSymbolSet",
        "SymbolSetEditor",
        "getSymbolSet",
        "updateSymbolSet"
      ],
      "description": "Admins can manage per-game symbol sets (slots/dice/cards/wheel): add/remove symbols, reorder, edit IDs/names, and upload images. Backend assigns `updatedAt` timestamps server-side for each symbol on update.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Consistent ExternalBlob image cache-busting with stable version tokens",
      "synonyms": [
        "getCacheBustedUrl",
        "addVersionToUrl",
        "updatedAt cache busting"
      ],
      "description": "Shared utilities append `?v=<updatedAt>` to ExternalBlob direct URLs so replaced images reliably refresh while unchanged images remain cacheable; used for app assets, banner images, catalog cover images, and symbol previews.",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "URL-based image import for admin image inputs",
      "synonyms": [
        "importImageFromUrl",
        "image URL replacement",
        "remote image fetch"
      ],
      "description": "Admin editors accept http/https image URLs, fetch the image client-side, validate content type and size (max 5MB), convert to `ExternalBlob`, and store using the same blob flow as file uploads.",
      "reqIds": [
        "REQ-10"
      ],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Hidden admin unlock flow with per-session gating",
      "synonyms": [
        "useAdminUnlock",
        "AdminUnlockDialog",
        "logo click unlock",
        "session admin mode"
      ],
      "description": "Admin settings UI entry points remain hidden unless both conditions are met: (1) backend reports the user is an admin and (2) the user unlocks admin mode for the current session by clicking the site logo and entering the password \"DexGod\". Includes an explicit lock action and clears unlock state on logout.",
      "reqIds": [
        "REQ-7",
        "REQ-11"
      ],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Admin settings modal with tabbed configuration editors",
      "synonyms": [
        "AdminSettingsModal",
        "General/Theme/Banner/Symbols/Catalog/Images"
      ],
      "description": "Provides a single modal with tabbed editors for branding + casino settings, theme, bottom banner, symbol sets, game catalog, and app assets, wired to backend mutations with toast feedback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Game lobby with dynamic asset/catalog integration and leaderboards",
      "synonyms": [
        "GameLobby",
        "lazy-loaded cover grid",
        "user stats panel"
      ],
      "description": "Displays a fixed list of supported games with cover images sourced from either persisted catalog entries or fallback app assets; cover images are lazy-loaded and error-handled. Shows leaderboards and current-user stats when authenticated.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Playable betting mini-games integrated with backend outcome recording",
      "synonyms": [
        "SlotsGame",
        "BlackjackGame",
        "DiceRollGame",
        "WheelSpinGame",
        "JackpotGame"
      ],
      "description": "Implements multiple interactive betting games (Slots, Blackjack, Dice Roll, Wheel Spin, Jackpot) with UI validation, win/loss resolution, animations, and calls to `recordGameOutcome` to update balances, transactions, and stats.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Canvas particle effects and easing utilities for win animations",
      "synonyms": [
        "ParticleSystem",
        "useParticleSystem",
        "createExplosion",
        "createConfetti",
        "createSparkles",
        "easeOutCubic",
        "easeOutBounce"
      ],
      "description": "Provides a reusable canvas-based particle system and easing helpers used by games to render celebratory effects and smooth motion timing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "SVG sanitization utility for safer SVG rendering",
      "synonyms": [
        "sanitizeSvg",
        "isValidSvg",
        "renderSafeSvg"
      ],
      "description": "Validates/sanitizes SVG strings by blocking unsafe tags/attributes and enforcing a size limit; provides a safe fallback SVG when input is invalid.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Stripe checkout session creation and session status via IC HTTP outcalls",
      "synonyms": [
        "createCheckoutSession",
        "getStripeSessionStatus",
        "http_request outcalls",
        "transform"
      ],
      "description": "Backend supports admin-managed Stripe configuration and user-accessible checkout session creation and status checks. Uses IC `http_request` outcalls with a response transform that strips headers.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Blob-storage maintenance and cycles refill endpoints",
      "synonyms": [
        "_caffeineStorageUpdateGatewayPrincipals",
        "_caffeineStorageBlobsToDelete",
        "_caffeineStorageConfirmBlobDeletion",
        "_caffeineStorageRefillCashier"
      ],
      "description": "Includes maintenance endpoints for blob storage: refreshing authorized gateway principals via a cashier canister, listing and pruning dead blobs (with forced GC trigger), and cashier cycles refills under strict caller checks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "State migration for symbol-set timestamp support",
      "synonyms": [
        "migration.mo",
        "symbol updatedAt migration"
      ],
      "description": "Provides a migration that upgrades persisted symbol sets by adding `updatedAt` timestamps to existing symbols to support stable cache-busting and freshness tracking.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-create-a-default-site-logo-fallback-image-from-the-user-provided-upload-and-add-it-as-a-static-asset-at-frontend-public-assets-generated-site-logo-fallback-dim-256x256-png-formatted-to-a-256-256-square-and-preserving-transparency-if-present",
      "title": "Create a default site logo fallback image from the user-provided upload and add it as a static asset at `frontend/public/assets/generated/site-logo-fallback.dim_256x256.png`, formatted to a 256×256 square and preserving transparency if present.",
      "reqIds": [
        "REQ-12"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-generated-fallback-logo-asset-is-served-directly-from-the-frontend-static-assets-do-not-route-it-through-the-backend-canister",
      "title": "Ensure the generated fallback logo asset is served directly from the frontend static assets (do not route it through the backend canister).",
      "reqIds": [
        "REQ-13"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [],
  "architectural_notes": [
    "Frontend canister calls are centralized via TanStack React Query hooks (query keys per resource; mutation success triggers invalidate/refetch) built on top of a shared `useActor` hook.",
    "Authentication uses an Internet Identity React context wrapping `@dfinity/auth-client`, supporting identity rehydration on load plus login/logout status tracking.",
    "Backend actor creation is identity-bound; upon authenticated actor creation the frontend calls `_initializeAccessControlWithSecret` to bootstrap roles using a secret from the URL hash/session.",
    "Motoko backend composes cross-cutting concerns via mixins (`MixinAuthorization` for RBAC endpoints and `blob-storage/Mixin` for storage maintenance endpoints).",
    "Backend state is held in in-memory `Map` registries (profiles, transactions, outcomes, symbol sets, catalog, assets) with a migration module for schema evolution (symbol `updatedAt`).",
    "Theming is applied at runtime by writing CSS variables to `document.documentElement` (`ThemeApplier` + `applyTheme`), and key UI surfaces read these variables with fallbacks.",
    "Images are stored as `ExternalBlob` and rendered via `getDirectURL()`; a shared cache-busting helper appends a stable version token (`updatedAt`) to URLs to avoid stale browser caches after replacements.",
    "Admin UX is consolidated into a single tabbed modal containing editors for general settings, theme, banner, symbols, catalog, and images.",
    "Admin access is gated by two layers: backend admin authorization plus a frontend per-session “unlock” password flow triggered by clicking the site logo.",
    "Stripe integration uses IC `http_request` outcalls with a transform function that strips headers from responses before returning to canister logic."
  ],
  "known_issues": [
    "Security/integrity: all game randomness and win/loss computation are client-side (e.g., `Math.random()`), and the backend `recordGameOutcome` trusts caller-provided `betAmount`/`winAmount`/`isWin`, enabling malicious clients to mint winnings or avoid losses.",
    "Accounting semantics allow “break-even/push” ambiguity: frontend games sometimes set `winAmount=bet` while `isWin=false`; backend treats `isWin=false` as a loss and subtracts `betAmount`, so pushes can be incorrectly charged.",
    "Unbounded growth: `transactionHistory` and `gameOutcomes` append indefinitely with no pagination or pruning, risking memory growth and slower queries over time.",
    "Stripe bug: `buildCheckoutSessionBody` always uses `shipping_address_collection[allowed_countries][0]` for every country, so multiple allowed countries are encoded incorrectly.",
    "Blob-storage env var appears misspelled: `CAFFFEINE_STORAGE_CASHIER_PRINCIPAL` (triple “F”) is required at runtime; likely deployment misconfiguration risk.",
    "`ParticleSystem.destroy()` removes the resize listener using a new arrow function reference, so the event listener is not actually removed; additionally `resize()` repeatedly calls `ctx.scale(...)` without resetting transforms, which can accumulate scaling.",
    "Symbol-set storage model is inconsistent: `gameSymbolSets` is keyed by `gameType` but stores a full `GameSymbolSet` value each time, which can lead to divergent copies per key depending on update patterns.",
    "Cache-busting `updatedAt` for banner config, app assets, and game catalog entries is supplied by the client and stored as-is (not generated/validated server-side), which can lead to inconsistent timestamps and weak trust in version metadata.",
    "Frontend admin unlock uses a hardcoded password (`DexGod`) embedded in client code; even with backend admin checks, the password is not secret and provides only UX-level obscurity.",
    "`useAdminUnlock` listens for the `storage` event to sync state, but it uses `sessionStorage` (not shared across tabs), so cross-tab synchronization and the intended “logout in another tab” behavior is unreliable."
  ],
  "isFixRequest": false,
  "imageRequirements": "## Required Images\n- Gold coin mascot logo on transparent background, centered with padding (site-logo-fallback.dim_256x256.png)",
  "generatedImages": [
    {
      "filename": "site-logo-fallback.dim_256x256.png",
      "description": "Gold coin mascot logo on transparent background, centered with padding",
      "targetWidth": 256,
      "targetHeight": 256
    }
  ],
  "gameProjectType": "none",
  "projectName": "Diamond Casino",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}